//杨辉三角型问题
int c6_7()
{
	int *a[10];
	
	int i,j;
	
	int x = 1;
	
	a[0] = &x; 

	for(i=1;i<10;i++)
	{
		a[i] = (int*)malloc(sizeof(int)*(i+1)); //i=1时对应的其实是第二行,所以每次的动态申请要申请i+1的空间

		*a[i] = 1;	//每行首个数都是1

		for(j = 1;j < i ; j++) //第(i+1)行就有i+1个数,本循环共循环i-1次,另外一个首尾的1都已经在循环前后赋值了
		{
			*(a[i]+j) = *(a[i-1]+j-1) + *(a[i-1]+j);//计算第i+1行的数值
		}
		*(a[i]+j) = 1; //每行尾都是1
	}
	for(i=0;i<10;i++){
		for(j=0;j<=i;j++) //每行注意是i+1个数,所以循环也是i+1次呢!
		{
			printf("%4d",*(a[i]+j));
		}
		printf("\n");
	}
	for(i=1;i<10;i++)
	{
		free(a[i]);
	}

}